       IDENTIFICATION DIVISION.
       PROGRAM-ID. L01HELLO.

       PROCEDURE DIVISION.
           DISPLAY "Bonjour, COBOL !".
           DISPLAY "Lecon 1 OK : structure minimale.".
           STOP RUN.
       END PROGRAM L01HELLO.
